Управление_ИТФирмой/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипКонтрогента</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_ИТФирмой/src/Enums/ТипКонтрогента/ТипКонтрогента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипКонтрогента</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Управление_ИТФирмой/src/Catalogs/Контрагенты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Тип = ПредопределенноеЗначение("Перечисление.ТипКонтрогента.ЮридическоеЛицо");
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;

КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДлинаИНН = СтрДлина (ИНН);
	ДлинаКПП = СтрДлина (КПП);
	
	Для ИННСимвол = 1 По ДлинаИНН Цикл
		
		СимволИНН = Сред (ИНН,ИННСимвол, 1); 
		КодСимволаИНН = КодСимвола (СимволИНН);
		Если КодСимволаИНН < 48 Или КодСимволаИНН > 57 Тогда
			Сообщить ("В ИНН присутствуют пробелы или другие недопустимые символы");
			Отказ = Истина;
		КонецЕсли;	
			
	КонецЦикла;   
	
	Для КППСимвол = 1 По ДлинаКПП Цикл
		
		СимволКПП = Сред (КПП,КППСимвол, 1); 
		КодСимволаКПП = КодСимвола (СимволКПП);
		Если КодСимволаКПП < 48 Или КодСимволаКПП > 57 Тогда
			Сообщить ("В КПП присутствуют пробелы или другие недопустимые символы");
			Отказ = Истина;
		КонецЕсли;	
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
